luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxI2c_regdef.h
/** \brief  Clock Control 1 Register */
typedef struct _Ifx_I2C_CLC1_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int SPEN:1;                    /**< \brief [2:2] Module Suspend Enable Bit for OCDS (rw) */
    unsigned int EDIS:1;                    /**< \brief [3:3] External Request Disable (rw) */
    unsigned int SBWE:1;                    /**< \brief [4:4] Module Suspend Bit Write Enable for OCDS (w) */
    unsigned int FSOE:1;                    /**< \brief [5:5] Fast Switch Off Enable (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int RMC:8;                     /**< \brief [15:8] Clock Divider for Standard Run Mode (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_I2C_CLC1_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_I2C_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_I2C_CLC_Bits;

/** \brief  End Data Control Register */
typedef struct _Ifx_I2C_ENDDCTRL_Bits
{
    unsigned int SETRSC:1;                  /**< \brief [0:0] Set Restart Condition (w) */
    unsigned int SETEND:1;                  /**< \brief [1:1] Set End of Transmission (w) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_I2C_ENDDCTRL_Bits;

/** \brief  Error Interrupt Request Source Clear Register */
typedef struct _Ifx_I2C_ERRIRQSC_Bits
{
    unsigned int RXF_UFL:1;                 /**< \brief [0:0] RX FIFO Underflow (w) */
    unsigned int RXF_OFL:1;                 /**< \brief [1:1] RX FIFO Overflow (w) */
    unsigned int TXF_UFL:1;                 /**< \brief [2:2] TX FIFO Underflow (w) */
    unsigned int TXF_OFL:1;                 /**< \brief [3:3] TX FIFO Overflow (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_I2C_ERRIRQSC_Bits;

/** \brief  Error Interrupt Request Source Mask Register */
typedef struct _Ifx_I2C_ERRIRQSM_Bits
{
    unsigned int RXF_UFL:1;                 /**< \brief [0:0] RX FIFO Underflow (rw) */
    unsigned int RXF_OFL:1;                 /**< \brief [1:1] RX FIFO Overflow (rw) */
    unsigned int TXF_UFL:1;                 /**< \brief [2:2] TX FIFO Underflow (rw) */
    unsigned int TXF_OFL:1;                 /**< \brief [3:3] TX FIFO Overflow (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_I2C_ERRIRQSM_Bits;

/** \brief  Error Interrupt Request Source Status Register */
typedef struct _Ifx_I2C_ERRIRQSS_Bits
{
    unsigned int RXF_UFL:1;                 /**< \brief [0:0] RX FIFO Underflow (rh) */
    unsigned int RXF_OFL:1;                 /**< \brief [1:1] RX FIFO Overflow (rh) */
    unsigned int TXF_UFL:1;                 /**< \brief [2:2] TX FIFO Underflow (rh) */
    unsigned int TXF_OFL:1;                 /**< \brief [3:3] TX FIFO Overflow (rh) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_I2C_ERRIRQSS_Bits;

/** \brief  Fractional Divider Configuration Register */
typedef struct _Ifx_I2C_FDIVCFG_Bits
{
    unsigned int DEC:11;                    /**< \brief [10:0] Decrement Value of Fractional Divider (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int INC:8;                     /**< \brief [23:16] Increment Value of Fractional Divider (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_I2C_FDIVCFG_Bits;

/** \brief  Fractional Divider High-speed Mode Configuration Register */
typedef struct _Ifx_I2C_FDIVHIGHCFG_Bits
{
    unsigned int DEC:11;                    /**< \brief [10:0] Decrement Value of Fractional Divider (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int INC:8;                     /**< \brief [23:16] Increment Value of Fractional Divider (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_I2C_FDIVHIGHCFG_Bits;

/** \brief  Filled FIFO Stages Status Register */
typedef struct _Ifx_I2C_FFSSTAT_Bits
{
    unsigned int FFS:6;                     /**< \brief [5:0] Filled FIFO Stages (rh) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_FFSSTAT_Bits;

/** \brief  FIFO Configuration Register */
typedef struct _Ifx_I2C_FIFOCFG_Bits
{
    unsigned int RXBS:2;                    /**< \brief [1:0] RX Burst Size (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int TXBS:2;                    /**< \brief [5:4] TX Burst Size (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int RXFA:2;                    /**< \brief [9:8] RX FIFO Alignment (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int TXFA:2;                    /**< \brief [13:12] TX FIFO Alignment (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int RXFC:1;                    /**< \brief [16:16] RX FIFO Flow Control (rw) */
    unsigned int TXFC:1;                    /**< \brief [17:17] TX FIFO Flow Control (rw) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_I2C_FIFOCFG_Bits;

/** \brief  General Purpose Control Register */
typedef struct _Ifx_I2C_GPCTL_Bits
{
    unsigned int PISEL:3;                   /**< \brief [2:0] Port Input Select (rw) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_I2C_GPCTL_Bits;

/** \brief  Interrupt Clear Register */
typedef struct _Ifx_I2C_ICR_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (w) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (w) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (w) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_I2C_ICR_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_I2C_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODNUMBER:8;               /**< \brief [15:8] Module Number Value (r) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_I2C_ID_Bits;

/** \brief  Interrupt Mask Control Register */
typedef struct _Ifx_I2C_IMSC_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (rw) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (rw) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (rw) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (rw) */
    unsigned int I2C_ERR_INT:1;             /**< \brief [4:4] I2C Error Interrupt (rw) */
    unsigned int I2C_P_INT:1;               /**< \brief [5:5] I2C Protocol Interrupt (rw) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_IMSC_Bits;

