luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxI2c_regdef.h
/** \brief  Interrupt Set Register */
typedef struct _Ifx_I2C_ISR_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (w) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (w) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (w) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (w) */
    unsigned int I2C_ERR_INT:1;             /**< \brief [4:4] I2C Error Interrupt (w) */
    unsigned int I2C_P_INT:1;               /**< \brief [5:5] I2C Protocol Interrupt (w) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_ISR_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_I2C_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_I2C_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_I2C_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_I2C_KRST1_Bits;

/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_I2C_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_I2C_KRSTCLR_Bits;

/** \brief  Masked Interrupt Status Register */
typedef struct _Ifx_I2C_MIS_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (rh) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (rh) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (rh) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (rh) */
    unsigned int I2C_ERR_INT:1;             /**< \brief [4:4] I2C Error Interrupt (rh) */
    unsigned int I2C_P_INT:1;               /**< \brief [5:5] I2C Protocol Interrupt (rh) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_MIS_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_I2C_MODID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_I2C_MODID_Bits;

/** \brief  Maximum Received Packet Size Control Register */
typedef struct _Ifx_I2C_MRPSCTRL_Bits
{
    unsigned int MRPS:14;                   /**< \brief [13:0] Maximum Received Packet Size (rwh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_I2C_MRPSCTRL_Bits;

/** \brief  Protocol Interrupt Request Source Clear Register */
typedef struct _Ifx_I2C_PIRQSC_Bits
{
    unsigned int AM:1;                      /**< \brief [0:0] Address Match (w) */
    unsigned int GC:1;                      /**< \brief [1:1] General Call (w) */
    unsigned int MC:1;                      /**< \brief [2:2] Master Code (w) */
    unsigned int AL:1;                      /**< \brief [3:3] Arbitration Lost (w) */
    unsigned int NACK:1;                    /**< \brief [4:4] Not-acknowledge Received (w) */
    unsigned int TX_END:1;                  /**< \brief [5:5] Transmission End (w) */
    unsigned int RX:1;                      /**< \brief [6:6] Receive Mode (w) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_I2C_PIRQSC_Bits;

/** \brief  Protocol Interrupt Request Source Mask Register */
typedef struct _Ifx_I2C_PIRQSM_Bits
{
    unsigned int AM:1;                      /**< \brief [0:0] Address Match (rw) */
    unsigned int GC:1;                      /**< \brief [1:1] General Call (rw) */
    unsigned int MC:1;                      /**< \brief [2:2] Master Code (rw) */
    unsigned int AL:1;                      /**< \brief [3:3] Arbitration Lost (rw) */
    unsigned int NACK:1;                    /**< \brief [4:4] Not-acknowledge Received (rw) */
    unsigned int TX_END:1;                  /**< \brief [5:5] Transmission End (rw) */
    unsigned int RX:1;                      /**< \brief [6:6] Receive Mode (rw) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_I2C_PIRQSM_Bits;

/** \brief  Protocol Interrupt Request Source Status Register */
typedef struct _Ifx_I2C_PIRQSS_Bits
{
    unsigned int AM:1;                      /**< \brief [0:0] Address Match (rh) */
    unsigned int GC:1;                      /**< \brief [1:1] General Call (rh) */
    unsigned int MC:1;                      /**< \brief [2:2] Master Code (rh) */
    unsigned int AL:1;                      /**< \brief [3:3] Arbitration Lost (rh) */
    unsigned int NACK:1;                    /**< \brief [4:4] Not-acknowledge Received (rh) */
    unsigned int TX_END:1;                  /**< \brief [5:5] Transmission End (rh) */
    unsigned int RX:1;                      /**< \brief [6:6] Receive Mode (rh) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_I2C_PIRQSS_Bits;

/** \brief  Raw Interrupt Status Register */
typedef struct _Ifx_I2C_RIS_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (rh) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (rh) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (rh) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (rh) */
    unsigned int I2C_ERR_INT:1;             /**< \brief [4:4] I2C Error Interrupt (rh) */
    unsigned int I2C_P_INT:1;               /**< \brief [5:5] I2C Protocol Interrupt (rh) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_RIS_Bits;

/** \brief  Received Packet Size Status Register */
typedef struct _Ifx_I2C_RPSSTAT_Bits
{
    unsigned int RPS:14;                    /**< \brief [13:0] Received Packet Size (rh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_I2C_RPSSTAT_Bits;

/** \brief  RUN Control Register */
typedef struct _Ifx_I2C_RUNCTRL_Bits
{
    unsigned int RUN:1;                     /**< \brief [0:0] Enable I2C-bus Interface (rw) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_I2C_RUNCTRL_Bits;

